Public Attributes | List of all members
API_StairPolylineVertexData Struct Reference
Element Manager API
Stores data of a stair polyline vertex. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_StairPolyTypeID  | type
The type of the boundary polyline section.
API_StairPolyGeometryTypeID  | geometryType
The geometry type of the boundary polyline section.
UInt32  | subElemId
The subelement identifier of the boundary polyline section.
bool  | isTop
The section describes the top of the subelement.
bool  | isBottom
The section describes the bottom of the subelement.
bool  | isFront
The section describes the front of the subelement.
bool  | isBack
The section describes the back of the subelement.
UInt32  | customId
Internal identifier.
API_StairTurnTypeID  | turnType
The type of the turn. |APIST_NoTurn|No turn.| |APIST_LandingTurn|Type is landing turn.| |APIST_WinderTurn|Type is winder turn.| |APIST_DividedLandingTurn|Type is divided landing turn.|.
Int32  | winderStepNumBackward
Number of Winder Steps backward.
Int32  | winderStepNumForward
Number of Winder Steps forward.
bool  | symmetricalLandingOffset
Lead Edge Offset and Trail Edge Offset are linked.
double  | minLandingStartEdgeOffset
Minimal Lead Edge Offset.
double  | minLandingEndEdgeOffset
Minimal Trail Edge Offset.
double  | currLandingStartEdgeOffset
Calculated Lead Edge Offset.
double  | currLandingEndEdgeOffset
Calculated Trail Edge Offset.
API_StairInnerWidthOffsetTypeID  | innerWidthOffsetType
The type of the Riser Offsets from Corner: |APIIWO_Min|Minimum Riser Offset.| |APIIWO_Fix|Fixed Riser Offset.|.
API_StairWinderNumTypeID  | numOfWindersType
The type of the Number of Winders: |APIWN_Min|Minimum Number of Winders.| |APIWN_Fix|Fixed Number of Winders.|.
API_StairDLWinderNumTypeID  | dividedLandingNumOfWindersType
Winders division method type.
Int32  | dividedLandingFixedNumOfSteps
Number of steps on Divided Landing if the division method is Fixed Number of Goings.
API_StairWinderID  | winderType
The type of the Winder: |APIWT_DINTurn|Auxiliary Walking Line| |APIWT_NZETurn|Two Points| |APIWT_SIPTurn|Single Point| |APIWT_AGNTurn|Principal Lines|.
Detailed Description
Stores data of a stair polyline vertex.
Member Data Documentation
◆ currLandingEndEdgeOffset
 API_StairPolylineVertexData::currLandingEndEdgeOffset
Calculated Trail Edge Offset.
◆ currLandingStartEdgeOffset
 API_StairPolylineVertexData::currLandingStartEdgeOffset
Calculated Lead Edge Offset.
◆ customId
 API_StairPolylineVertexData::customId
Internal identifier.
◆ dividedLandingFixedNumOfSteps
 API_StairPolylineVertexData::dividedLandingFixedNumOfSteps
Number of steps on Divided Landing if the division method is Fixed Number of Goings.
◆ dividedLandingNumOfWindersType
 API_StairPolylineVertexData::dividedLandingNumOfWindersType
Winders division method type.
◆ geometryType
 API_StairPolylineVertexData::geometryType
The geometry type of the boundary polyline section.
◆ innerWidthOffsetType
 API_StairPolylineVertexData::innerWidthOffsetType
The type of the Riser Offsets from Corner: |APIIWO_Min|Minimum Riser Offset.| |APIIWO_Fix|Fixed Riser Offset.|.
◆ isBack
 API_StairPolylineVertexData::isBack
The section describes the back of the subelement.
◆ isBottom
 API_StairPolylineVertexData::isBottom
The section describes the bottom of the subelement.
◆ isFront
 API_StairPolylineVertexData::isFront
The section describes the front of the subelement.
◆ isTop
 API_StairPolylineVertexData::isTop
The section describes the top of the subelement.
◆ minLandingEndEdgeOffset
 API_StairPolylineVertexData::minLandingEndEdgeOffset
Minimal Trail Edge Offset.
◆ minLandingStartEdgeOffset
 API_StairPolylineVertexData::minLandingStartEdgeOffset
Minimal Lead Edge Offset.
◆ numOfWindersType
 API_StairPolylineVertexData::numOfWindersType
The type of the Number of Winders: |APIWN_Min|Minimum Number of Winders.| |APIWN_Fix|Fixed Number of Winders.|.
◆ subElemId
 API_StairPolylineVertexData::subElemId
The subelement identifier of the boundary polyline section.
◆ symmetricalLandingOffset
 API_StairPolylineVertexData::symmetricalLandingOffset
Lead Edge Offset and Trail Edge Offset are linked.
◆ turnType
 API_StairPolylineVertexData::turnType
The type of the turn. |APIST_NoTurn|No turn.| |APIST_LandingTurn|Type is landing turn.| |APIST_WinderTurn|Type is winder turn.| |APIST_DividedLandingTurn|Type is divided landing turn.|.
◆ type
 API_StairPolylineVertexData::type
The type of the boundary polyline section.
◆ winderStepNumBackward
 API_StairPolylineVertexData::winderStepNumBackward
Number of Winder Steps backward.
◆ winderStepNumForward
 API_StairPolylineVertexData::winderStepNumForward
Number of Winder Steps forward.
◆ winderType
 API_StairPolylineVertexData::winderType
The type of the Winder: |APIWT_DINTurn|Auxiliary Walking Line| |APIWT_NZETurn|Two Points| |APIWT_SIPTurn|Single Point| |APIWT_AGNTurn|Principal Lines|.